{"meta":{"title":"Darkness0710 Blog","subtitle":"","description":"","author":"Darkness0710","url":"https://hexo-theme-nexmoe-example.vercel.app","root":"/"},"pages":[{"title":"About","date":"2022-12-28T13:23:24.876Z","updated":"2022-12-28T13:23:24.876Z","comments":true,"path":"about.html","permalink":"https://hexo-theme-nexmoe-example.vercel.app/about.html","excerpt":"","text":"Thiên ngoại hữu thiên, nhân ngoại hữu nhân.Núi cao còn có núi cao hơn, đừng tự thỏa mãn chính mình với những hiểu biết của bản thân.Tất cả mới chỉ như “giọt nước” ở trong “đại dương” rộng lớn. Nickname：Darkness0710Introduction: Thích đọc truyện và xem anime.Github：https://github.com/darkness0710/ 2013 - 2017: Posts and Telecommunications Institute of Technology (PTIT)2017 - 2020: Framgia Inc (Sun Asterisk Inc)2020 - 2021: Paraline Inc2021 - Now: Sun Asterisk Inc My Certification Japanese-Language Proficiency Test N2Laravel CertificationPython Certification (PCEP-30-02)AWS Certified Cloud PractitionerAWS Certified Solutions Architect – AssociateAWS Certified Solutions Architect - ProfessionalAWS Certified Developer – AssociateAWS Certified SysOps Administrator – Associate"},{"title":"","date":"2022-12-28T12:11:37.154Z","updated":"2022-12-28T12:11:37.154Z","comments":true,"path":"custom.css","permalink":"https://hexo-theme-nexmoe-example.vercel.app/custom.css","excerpt":"","text":"#nexmoe-header .nexmoe-copyright { display: none; }"},{"title":"文章归档","date":"2022-11-16T15:18:27.438Z","updated":"2022-11-16T15:18:27.438Z","comments":true,"path":"archive.html","permalink":"https://hexo-theme-nexmoe-example.vercel.app/archive.html","excerpt":"","text":""},{"title":"Page","date":"2013-12-26T15:52:56.000Z","updated":"2022-11-16T15:18:27.445Z","comments":true,"path":"page/index.html","permalink":"https://hexo-theme-nexmoe-example.vercel.app/page/index.html","excerpt":"","text":"This is a page test."}],"posts":[{"title":"Plugin Sublime Text x Laravel","slug":"plugin_sublime_text_x_laravel","date":"2022-12-28T03:00:00.000Z","updated":"2022-12-28T11:48:34.666Z","comments":true,"path":"2022/12/28/plugin_sublime_text_x_laravel/","link":"","permalink":"https://hexo-theme-nexmoe-example.vercel.app/2022/12/28/plugin_sublime_text_x_laravel/","excerpt":"","text":"Sublime Text Mastery Các plugins cho Sublime TextPlugin common A file icon Material theme Colorsublime Package resource viewer Git Copy filepatch funny Sublime merge Sublimelinter SidebarEnhancements DocBlockr Plugin php PHP getter and setter Composer php-cs-fixer Sublimelinter-php Plugin laravel Laravel artisan 5 Laravel 5 Snippets for Sublime Text","categories":[{"name":"plugin","slug":"plugin","permalink":"https://hexo-theme-nexmoe-example.vercel.app/categories/plugin/"}],"tags":[]},{"title":"Plugin Vscode x Program","slug":"plugin_vscode_x_program","date":"2022-12-28T03:00:00.000Z","updated":"2022-12-28T13:59:35.159Z","comments":true,"path":"2022/12/28/plugin_vscode_x_program/","link":"","permalink":"https://hexo-theme-nexmoe-example.vercel.app/2022/12/28/plugin_vscode_x_program/","excerpt":"","text":"Các plugins cho VscodePlugin Common Code Spell Checker DotENV Material Icon Theme Prettier - Code formatter RayThis: Instant Beautiful Code Screenshots WSL Sublime Text Keymap and Settings Importer Plugin Git GitLens Plugin Docker Docker Plugin Rails Format file ERB rails Rails Rails Snippets Vscode-gemfile Plugin Ruby Ruby Rufo (Ruby formatter) VSCode Ruby Plugin PHP php cs fixer Plugin Laravel Laravel Artisan Laravel Blade formatter Laravel Blade Snippets Laravel Blade Spacer Laravel Extra Intellisense Laravel Goto Config Laravel Goto View Laravel Goto Controller Laravel Snippets Plugin JavaScript JavaScript (ES6) code snippets Plugin Python Magic Python Plugin Sql SQL Formatter","categories":[{"name":"plugin","slug":"plugin","permalink":"https://hexo-theme-nexmoe-example.vercel.app/categories/plugin/"}],"tags":[]},{"title":"Tản mạn chuyện dự án 01","slug":"project_talk_01","date":"2022-12-28T03:00:00.000Z","updated":"2022-12-28T14:52:40.994Z","comments":true,"path":"2022/12/28/project_talk_01/","link":"","permalink":"https://hexo-theme-nexmoe-example.vercel.app/2022/12/28/project_talk_01/","excerpt":"","text":"Giới thiệu bối cảnh Đây là seri câu chuyện về quãng thời gian dài tôi gắn bó với ngành lập trình.Câu chuyện này có thể là câu chuyện của bản thân tôi, cũng có thể là thuật lại câu chuyện của một người khác.Thế nên tôi quyết định đặt tên cho nhân vật trong câu chuyện là Z.Z là một chàng trai trẻ mới tốt nghiệp đại học và đang là thực tập viên cho công ty S. Câu chuyện đầu đời về chức năng register Sau khi Z gia nhập công ty S, Z được ra nhập một team dự án, tôi tạm gọi là dự án X.Chức năng đầu tiên Z được giao là hoàn thiện chức năng register user (Tạo mới tài khoản người dùng).Với một chức năng khá là đơn giản như vậy, Z dễ dàng hoàn thành công việc được giao trong vòng 4 tiếng và mở truyện “cô giáo thảo” lên đọc.Hóa ra khi đi làm dự án thực tế cũng không khó như tưởng tượng :D Chiếc bug đầu tiên Chỉ trong vòng 30 phút sau khi chức năng được deploy trên môi trường dev thì Z đã bị bà chị tester sang gõ đầu.Tạm thời tôi gọi tên bà chị tester khó tính này là “Nhung”.Z đã bị Nhung blame và nói rằng tại sao lại cho phép 2 user có cùng địa chỉ email vậy? Fix Bug Z đã rất bất ngờ vì chưa thấy chị nào hung dữ như bà chị này có mỗi cái bug mà cũng mắng cho được?Ngay lập tức Z bắt tay vào fix bug, bổ sung validate cho trường hợp nếu email trùng trong database thì không thể tạo được tài khoản đó và tiếp tục đọc truyện “cô giáo thảo”. Lại Bug Đời không như là mơ, tưởng mọi thứ đã êm đẹp thì Z lại tiếp tục nhận thêm 1 bug mới.Nhung lại tiếp tục blame Z: “Đã không thể tạo 2 email trùng nhau trong hệ thống nhưng tại sao 2 email trùng nhau nhưng in hoa khác nhau vẫn tạo được, sao trong database lại cho phép in hoa email thế kia?” Lại Fix Bug Z nhận ra mình đã mắc 2 sai lầm.Sai lầm thứ nhất là chưa downcase về chữ thường khi insert vào database.Sai lầm thứ hai là khi kiểm tra email tồn tại trong database, thì cũng phải downcase email đó rồi mới kiểm tra? Happy ending hay Bad ending? Z nhanh chóng fix cái bug trên và nghĩ rằng lần này sẽ không thể lủng cái bug nào được nữa.Không có gì bất ngờ chức năng đó đã được release production và có thể là happy ending cho chức năng register. Bug production Sau khi chức năng được release một thời gian, khách hàng thông báo tới đội dev có 2 email trùng nhau trong hệ thống.Sau khi kiểm tra lại thì cả đội dev lẫn đội tester đều nhận ra code không hề có vấn đề gì?Vậy tại sao hệ thống lại có thể có 2 email trùng nhau được? Explain bug Sau khi duyệt toàn bộ log hệ thống tại thời điểm đó, thì Z nhận ra rằng đồng thời điểm đó có 2 email trùng nhau được insert vào database.Tại sao lại như vậy khi trong code đã validate, mà code validate không hề sai.Quay lại vấn đề, cả Z lẫn Nhung đều đang không cover được trường hợp tạo 2 email giống nhau đồng thời.Khi 2 user đồng thời sử dụng chung 1 email khi đăng ký, 2 request đồng thời được gửi đến server.Cả 2 request đều được server phản hồi là chưa có email này trong database, và đồng thời được insert vào database. Giải quyết vấn đề và bài học rút ra Khi unique bất kì input nào chúng ta phải tạo giá trị cột unique cả trong database.Việc chỉ validate bằng code là chưa đủ.Dev cần cover các request song song, và tester cũng phải test các case liên quan request song song.","categories":[{"name":"plugin","slug":"plugin","permalink":"https://hexo-theme-nexmoe-example.vercel.app/categories/plugin/"}],"tags":[]}],"categories":[{"name":"plugin","slug":"plugin","permalink":"https://hexo-theme-nexmoe-example.vercel.app/categories/plugin/"}],"tags":[]}